physicax-web/cfd/backend/uploads/6d0176636b/case/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/* Auto-generated k */
dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 3.750000e+05;
boundaryField
{
    inlet
    {
        type fixedValue;
        value uniform 3.750000e+05;
    }
    outlet
    {
        type zeroGradient;
    }
    bottom
    {
        type symmetryPlane;
    }
    top
    {
        type symmetryPlane;
    }
    front
    {
        type symmetryPlane;
    }
    back
    {
        type symmetryPlane;
    }
    model
    {
        type kqRWallFunction;
        value uniform 3.750000e+05;
    }
}
