physicax-web/cfd/backend/uploads/6d0176636b/case/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/* Auto-generated snappyHexMeshDict (adjust as needed) */
castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    model
    {
        type triSurfaceMesh;
        file "model.stl";
    }
}

castellatedMeshControls
{
    maxLocalCells 1000000;
    maxGlobalCells 2000000;
    minRefinementCells 0;
    nCellsBetweenLevels 3;
    features
    (
        {
            file "model.eMesh";
            level 2;
        }
    );
    refinementSurfaces
    {
        model { level (3 4); }
    }
    locationInMesh (926.6862 2.6260 -1.1155);
}

snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 30;
    nRelaxIter 5;
}
